In [1]:
import pandas as pd

In [2]:
import numpy as np

In [3]:
pat = pd.read_csv("d_patients.csv",  usecols=['subject_id', 'sex', 'dob'], index_col='subject_id')

In [4]:
pat.shape

(4000, 2)

In [5]:
pat["dob"].min()

'1/1/2605 00:00:00'

In [6]:
pat["dob"].max()

'9/9/3293 00:00:00'

In [7]:
pat.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 4000 entries, 3 to 32763
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   sex     3987 non-null   object
 1   dob     4000 non-null   object
dtypes: object(2)
memory usage: 93.8+ KB

In [8]:
pat.index.nunique()

4000

In [9]:
pat["dob"] = pat["dob"].str.replace("00:00:00", "")

In [10]:
pat[[0,1,2]] = pat["dob"].str.split("/", expand =True)

# Converting date format into YYYY-MM-DD

In [11]:
pat[0] = pat[0].apply(lambda x: "0"+x if len(x)==1 else x)
pat[1] = pat[1].apply(lambda x: "0"+x if len(x)==1 else x)
pat["new"] = pat[2]+"-"+pat[1]+"-"+pat[0]
pat["new"] = pat["new"].str.replace(" ", "")

In [12]:
pat

           sex          dob   0   1      2         new
subject_id
3            M   28/2/2606   28  02  2606   2606-02-28
12           M   14/5/2803   14  05  2803   2803-05-14
21           M   22/5/3051   22  05  3051   3051-05-22
26           M    2/3/3007   02  03  3007   3007-03-02
31           M   17/5/2606   17  05  2606   2606-05-17
...         ..          ...  ..  ..    ...         ...
32686        M   6/12/2543   06  12  2543   2543-12-06
32705        F    5/3/3257   05  03  3257   3257-03-05
32706        M   14/2/2595   14  02  2595   2595-02-14
32711        F  21/12/3057   21  12  3057   3057-12-21
32763        M   10/4/2645   10  04  2645   2645-04-10

[4000 rows x 6 columns]

In [13]:
pat["new"] = pat["new"].apply(lambda x: np.datetime64(x))

In [14]:
pat.drop([0,1,2], axis= 1, inplace = True)

In [15]:
pat

           sex          dob         new
subject_id
3            M   28/2/2606   2606-02-28
12           M   14/5/2803   2803-05-14
21           M   22/5/3051   3051-05-22
26           M    2/3/3007   3007-03-02
31           M   17/5/2606   2606-05-17
...         ..          ...         ...
32686        M   6/12/2543   2543-12-06
32705        F    5/3/3257   3257-03-05
32706        M   14/2/2595   2595-02-14
32711        F  21/12/3057   3057-12-21
32763        M   10/4/2645   2645-04-10

[4000 rows x 3 columns]

## Admission File

In [16]:
adm = pd.read_csv("admissions.csv", usecols=['subject_id', 'admit_dt', 'hadm_id'], index_col='subject_id', parse_dates=['admit_dt'])

In [17]:
adm.shape

(5074, 2)

In [18]:
adm.index.nunique()

3952

In [19]:
adm.head()

            hadm_id            admit_dt
subject_id
24807             2   8/7/3033 00:00:00
7675              3  16/5/3388 00:00:00
23547             6   3/4/3381 00:00:00
14884            10  28/8/3015 00:00:00
8652             12  11/9/3125 00:00:00

In [20]:
adm["admit_dt"] = adm["admit_dt"].str.replace("00:00:00", "")

In [21]:
adm

            hadm_id     admit_dt
subject_id
24807             2    8/7/3033
7675              3   16/5/3388
23547             6    3/4/3381
14884            10   28/8/3015
8652             12   11/9/3125
...             ...          ...
29309         36005  11/12/2541
32711         36069   20/5/3143
32667         36071   18/2/2866
31134         36077   24/4/2724
28191         36103   27/4/2675

[5074 rows x 2 columns]

In [22]:
 adm[[0,1,2]] = adm["admit_dt"].str.split("/", expand =True)

In [23]:
adm

            hadm_id     admit_dt   0   1      2
subject_id
24807             2    8/7/3033    8   7  3033
7675              3   16/5/3388   16   5  3388
23547             6    3/4/3381    3   4  3381
14884            10   28/8/3015   28   8  3015
8652             12   11/9/3125   11   9  3125
...             ...          ...  ..  ..    ...
29309         36005  11/12/2541   11  12  2541
32711         36069   20/5/3143   20   5  3143
32667         36071   18/2/2866   18   2  2866
31134         36077   24/4/2724   24   4  2724
28191         36103   27/4/2675   27   4  2675

[5074 rows x 5 columns]

# Converting date format into YYYY-MM-DD

In [24]:
adm[0] = adm[0].apply(lambda x: "0"+x if len(x)==1 else x)
adm[1] = adm[1].apply(lambda x: "0"+x if len(x)==1 else x)
adm["new1"] = adm[2]+"-"+adm[1]+"-"+adm[0]
adm["new1"] = adm["new1"].str.replace(" ", "")
adm

            hadm_id     admit_dt   0   1      2        new1
subject_id
24807             2    8/7/3033   08  07  3033   3033-07-08
7675              3   16/5/3388   16  05  3388   3388-05-16
23547             6    3/4/3381   03  04  3381   3381-04-03
14884            10   28/8/3015   28  08  3015   3015-08-28
8652             12   11/9/3125   11  09  3125   3125-09-11
...             ...          ...  ..  ..    ...         ...
29309         36005  11/12/2541   11  12  2541   2541-12-11
32711         36069   20/5/3143   20  05  3143   3143-05-20
32667         36071   18/2/2866   18  02  2866   2866-02-18
31134         36077   24/4/2724   24  04  2724   2724-04-24
28191         36103   27/4/2675   27  04  2675   2675-04-27

[5074 rows x 6 columns]

In [25]:
adm["new1"] = adm["new1"].apply(lambda x: np.datetime64(x))

In [26]:
adm.drop([0,1,2], axis= 1, inplace = True)

In [27]:
adm

            hadm_id     admit_dt        new1
subject_id
24807             2    8/7/3033   3033-07-08
7675              3   16/5/3388   3388-05-16
23547             6    3/4/3381   3381-04-03
14884            10   28/8/3015   3015-08-28
8652             12   11/9/3125   3125-09-11
...             ...          ...         ...
29309         36005  11/12/2541   2541-12-11
32711         36069   20/5/3143   3143-05-20
32667         36071   18/2/2866   2866-02-18
31134         36077   24/4/2724   2724-04-24
28191         36103   27/4/2675   2675-04-27

[5074 rows x 3 columns]

# Getting first admission ID for each subject, by sorting the new1 (Numpy date) column and dropping the duplicates in subject_id

In [28]:
df6 = adm.reset_index().sort_values(["subject_id", "new1"]).drop_duplicates("subject_id")
df6

      subject_id  hadm_id     admit_dt        new1
362            3     2075    7/9/2682   2682-09-07
1962          12    12532   26/9/2875   2875-09-26
3280          21    20666  29/10/3138   3138-10-29
2363          26    15067    3/3/3079   3079-03-03
2410          31    15325   21/8/2678   2678-08-21
...          ...      ...          ...         ...
4743       32686    30102   27/5/2612   2612-05-27
4958       32705    33462    6/4/3337   3337-04-06
5052       32706    35651   20/3/2676   2676-03-20
5070       32711    36069   20/5/3143   3143-05-20
4891       32763    33007    5/6/2724   2724-06-05

[3952 rows x 4 columns]

# This is for check, that there must be 3952 records

In [29]:
df3 = adm.groupby(["subject_id"]).agg(first_admittime=('new1',np.min))
df3

           first_admittime
subject_id
3               2682-09-07
12              2875-09-26
21              3138-10-29
26              3079-03-03
31              2678-08-21
...                    ...
32686           2612-05-27
32705           3337-04-06
32706           2676-03-20
32711           3143-05-20
32763           2724-06-05

[3952 rows x 1 columns]

In [30]:
# subject ids which are unique in Patient's table = 4000, but in Admissions table unique are 3952 after sorting for
# first admission date. One may think they also must be 4000, but in the guide of MIMIC, they have stated that some of 
# the patients' data can be missing due to human error. so it is okay to go with 3952 ids

In [31]:
df6['admit_dt']

362       7/9/2682
1962     26/9/2875
3280    29/10/3138
2363      3/3/3079
2410     21/8/2678
           ...
4743     27/5/2612
4958      6/4/3337
5052     20/3/2676
5070     20/5/3143
4891      5/6/2724
Name: admit_dt, Length: 3952, dtype: object

In [32]:
pat["new"]

subject_id
3        2606-02-28
12       2803-05-14
21       3051-05-22
26       3007-03-02
31       2606-05-17
            ...
32686    2543-12-06
32705    3257-03-05
32706    2595-02-14
32711    3057-12-21
32763    2645-04-10
Name: new, Length: 4000, dtype: object

In [33]:
df6.head(1)

     subject_id  hadm_id   admit_dt        new1
362           3     2075  7/9/2682   2682-09-07

In [34]:
pat.head(1)

           sex         dob         new
subject_id
3            M  28/2/2606   2606-02-28

In [35]:
df7 = df6.merge(pat, left_on = "subject_id", right_on = pat.index, how = "left")
df7

,subject_id,hadm_id,admit_dt,new1,sex,dob,new
0,3,2075,7/9/2682,2682-09-07,M,28/2/2606,2606-02-28
1,12,12532,26/9/2875,2875-09-26,M,14/5/2803,2803-05-14
2,21,20666,29/10/3138,3138-10-29,M,22/5/3051,3051-05-22
3,26,15067,3/3/3079,3079-03-03,M,2/3/3007,3007-03-02
4,31,15325,21/8/2678,2678-08-21,M,17/5/2606,2606-05-17
...,...,...,...,...,...,...,...
3947,32686,30102,27/5/2612,2612-05-27,M,6/12/2543,2543-12-06
3948,32705,33462,6/4/3337,3337-04-06,F,5/3/3257,3257-03-05
3949,32706,35651,20/3/2676,2676-03-20,M,14/2/2595,2595-02-14
3950,32711,36069,20/5/3143,3143-05-20,F,21/12/3057,3057-12-21
3951,32763,33007,5/6/2724,2724-06-05,M,10/4/2645,2645-04-10

In [36]:
df7["age_at_adm"] = df7["new1"] - df7["new"]
df7["age_at_adm"] = df7["age_at_adm"].astype("timedelta64[Y]")

In [37]:
df7

,subject_id,hadm_id,admit_dt,new1,sex,dob,new,age_at_adm
0,3,2075,7/9/2682,2682-09-07,M,28/2/2606,2606-02-28,76.0
1,12,12532,26/9/2875,2875-09-26,M,14/5/2803,2803-05-14,72.0
2,21,20666,29/10/3138,3138-10-29,M,22/5/3051,3051-05-22,87.0
3,26,15067,3/3/3079,3079-03-03,M,2/3/3007,3007-03-02,72.0
4,31,15325,21/8/2678,2678-08-21,M,17/5/2606,2606-05-17,72.0
...,...,...,...,...,...,...,...,...
3947,32686,30102,27/5/2612,2612-05-27,M,6/12/2543,2543-12-06,68.0
3948,32705,33462,6/4/3337,3337-04-06,F,5/3/3257,3257-03-05,80.0
3949,32706,35651,20/3/2676,2676-03-20,M,14/2/2595,2595-02-14,81.0
3950,32711,36069,20/5/3143,3143-05-20,F,21/12/3057,3057-12-21,85.0
3951,32763,33007,5/6/2724,2724-06-05,M,10/4/2645,2645-04-10,79.0

# Dropping patients elder than 99 years of age and younger than 15 years of age. so as to get data of adults.

In [38]:
df7.drop(df7[df7["age_at_adm"]<=15].index, inplace = True)
df7

,subject_id,hadm_id,admit_dt,new1,sex,dob,new,age_at_adm
0,3,2075,7/9/2682,2682-09-07,M,28/2/2606,2606-02-28,76.0
1,12,12532,26/9/2875,2875-09-26,M,14/5/2803,2803-05-14,72.0
2,21,20666,29/10/3138,3138-10-29,M,22/5/3051,3051-05-22,87.0
3,26,15067,3/3/3079,3079-03-03,M,2/3/3007,3007-03-02,72.0
4,31,15325,21/8/2678,2678-08-21,M,17/5/2606,2606-05-17,72.0
...,...,...,...,...,...,...,...,...
3947,32686,30102,27/5/2612,2612-05-27,M,6/12/2543,2543-12-06,68.0
3948,32705,33462,6/4/3337,3337-04-06,F,5/3/3257,3257-03-05,80.0
3949,32706,35651,20/3/2676,2676-03-20,M,14/2/2595,2595-02-14,81.0
3950,32711,36069,20/5/3143,3143-05-20,F,21/12/3057,3057-12-21,85.0
3951,32763,33007,5/6/2724,2724-06-05,M,10/4/2645,2645-04-10,79.0

# Dropping redundant columns

In [39]:
df7.drop(["admit_dt", "dob"], axis =1, inplace = True)

In [40]:
df7.rename(columns = {"new1":"admit_dt", "new": "dob"}, inplace = True)

In [41]:
df7.reset_index(drop = True, inplace = True )

In [42]:
df7

      subject_id  hadm_id    admit_dt sex         dob  age_at_adm
0              3     2075  2682-09-07   M  2606-02-28        76.0
1             12    12532  2875-09-26   M  2803-05-14        72.0
2             21    20666  3138-10-29   M  3051-05-22        87.0
3             26    15067  3079-03-03   M  3007-03-02        72.0
4             31    15325  2678-08-21   M  2606-05-17        72.0
...          ...      ...         ...  ..         ...         ...
3918       32686    30102  2612-05-27   M  2543-12-06        68.0
3919       32705    33462  3337-04-06   F  3257-03-05        80.0
3920       32706    35651  2676-03-20   M  2595-02-14        81.0
3921       32711    36069  3143-05-20   F  3057-12-21        85.0
3922       32763    33007  2724-06-05   M  2645-04-10        79.0

[3923 rows x 6 columns]

In [43]:
df7.to_csv("selected_ids.csv", index = False)